#include "libft.h"

/* ************************************************************************** */
/*                                                                            */
/*   Заполнение первых n символов буфера b символами с                        */
/*                                                                            */
/* ************************************************************************** */

void	*ft_memset(void *b, int c, size_t len)
{
	size_t	i;
	char	*tmp;

	i = 0;
	tmp = (char *)b;
	while (i < len)
	{
		tmp[i] = c;
		i++;
	}
	b = (void *)tmp;
	return (b);
}
