#include "libft.h"

/* ************************************************************************** */
/*                                                                            */
/*   Копирует содержимое нуль-терминированной строки                          */
/*   в буфер ограниченного размера.                                           */
/*   Возвращает размер строки, которую пыталась скопировать                   */
/*                                                                            */
/* ************************************************************************** */

size_t	ft_strlcpy(char *dst, char *src, size_t dstsize)
{
	size_t	i;

	if (!dstsize)
		return (ft_strlen(src));
	i = 0;
	while (i < (dstsize - 1) && src[i])
	{
		dst[i] = src[i];
		i++;
	}
	dst[i] = '\0';
	return (ft_strlen(src));
}
